app/views/posts/index.html.erb

      <td><%= post.id %></td>
      <td><%= post.comments.count %></td>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY "comments"."id" DESC LIMIT 1  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]