app/views/posts/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "post_categoryships" ON "categories"."id" = "post_categoryships"."category_id" WHERE "post_categoryships"."post_id" = ?  [["post_id", 1]]
---
<p>Category:
  <% @post.categories.each do |g| %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY updated_at desc  [["post_id", 16]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---

<p>Total comments:<%= @post.comments.count%></p>