app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "draft", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "wefef"], ["draft", "t"], ["post_id", 16], ["user_id", 1], ["created_at", "2016-06-24 21:22:39.822352"], ["updated_at", "2016-06-24 21:22:39.822352"]]
---
  def create
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user
    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 1], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def edit
    if @post.user != current_user
      flash[:alert] = "not authorized"
      redirect_to post_path(@post)
    else
      @comment = @post.comments.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 1], ["id", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "wwwwewefew"], ["updated_at", "2016-06-22 01:52:00.603336"], ["id", 1]]
UPDATE "posts" SET "comment_last_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["comment_last_updated_at", "2016-06-24 20:59:55.638354"], ["updated_at", "2016-06-24 20:59:55.694019"], ["id", 13]]
---
  def update
    @comment = @post.comments.find(params[:id])
    if @comment.update(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 1], ["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
UPDATE "posts" SET "comment_last_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["comment_last_updated_at", nil], ["updated_at", "2016-06-22 21:07:22.161216"], ["id", 16]]
---
  def destroy

    if @post.user != current_user
      flash[:alert] = "Not authorized"
      redirect_to post_path(@post)
    else
      @comment = @post.comments.find(params[:id])
      @comment.destroy


      if @post.comments_count > 1
        @post.comment_last_updated_at = Comment.order("updated_at").last.updated_at

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 23]]
---
  def set_post
    @post = Post.find(params[:post_id])