app/controllers/posts_controller.rb

  def index

    if params[:sort]&&params[:sort] == "Ruby"
      @posts = Category.find_by(:name =>"Ruby").posts
    elsif params[:sort]&&params[:sort] == "Perl"
      @posts = Category.find_by(:name =>"Perl").posts
    elsif params[:sort]&&params[:sort] == "Java"
      @posts = Category.find_by(:name => "Java").posts
    else
      @posts = Post.all.order("updated_at DESC")
    end

    if current_user &&current_user.admin?
      @posts = Post.all.order("updated_at DESC")
    elsif current_user
      @posts = @posts.where("user_id = ? or status = ?", current_user.id, "release")
    elsif
      @posts = @posts.where("status = 'release'")
    end

    if params[:order]
      if params[:order] == 'last_comment_time'
        @posts = @posts.order("comment_last_updated_at DESC")
      elsif params[:order] && params[:order] == 'comment_number'
        @posts = @posts.order("comments_count DESC")
      elsif params[:order] && params[:order] == "topic_clicks"
        @posts = @posts.order("clicked DESC")
      end
    end

    @posts = @posts.page(params[:page]).per(6)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "ruby"]]
SELECT "posts".* FROM "posts" INNER JOIN "post_categoryships" ON "posts"."id" = "post_categoryships"."post_id" WHERE "post_categoryships"."category_id" = ?  [["category_id", 2]]
SELECT COUNT(*) FROM "posts"
SELECT  "posts".* FROM "posts" LIMIT 7 OFFSET 0
SELECT "categories".* FROM "categories"