app/controllers/posts_controller.rb

  def index

    @posts = Post.all

    if params[:sort] == "Ruby"
      @posts = Category.find_by(:name =>"Ruby").posts.where(:draft => false).page(params[:page]).per(5)
    elsif params[:sort] == "Perl"
      @posts = Category.find_by(:name =>"Perl").posts.where(:draft => false).page(params[:page]).per(5)
    elsif params[:sort] == "Java"
      @posts = Category.find_by(:name =>"Java").posts.where(:draft => false).page(params[:page]).per(5)
    else
      @posts = Post.all.order("updated_at DESC").where(:draft => false).page(params[:page]).per(5)
    end


    if params[:order]
      if params[:order] == 'last_comment_time'
        @posts = Post.all.order("comment_last_updated_at DESC").where(:draft => false).page(params[:page]).per(5)
      elsif params[:order] && params[:order] == 'comment_number'
        @posts = Post.all.order("comments_count DESC").where(:draft => false).page(params[:page]).per(5)
      elsif params[:order] && params[:order] == "topic_clicks"
        @posts = Post.all.order("clicked DESC").where(:draft => false).page(params[:page]).per(5)
---
SELECT "posts".* FROM "posts" WHERE (author_id =1 or draft='false')  ORDER BY updated_at DESC
SELECT  "posts".* FROM "posts" WHERE "posts"."draft" = ?  ORDER BY updated_at DESC LIMIT 5 OFFSET 0  [["draft", "f"]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."draft" = ?  [["draft", "f"]]
SELECT "posts".* FROM "posts" WHERE "posts"."draft" = ?  ORDER BY clicked DESC  [["draft", "f"]]

  def show
    @post.clicked += 1
    @post.save

    # @comments = @post.comments.order("updated_at desc")
    if current_user.nil?
      @comments = @post.comments.where(:draft=>"false").order("updated_at desc")
---
UPDATE "posts" SET "clicked" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["clicked", 1], ["updated_at", "2016-06-22 19:26:32.087872"], ["id", 7]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY updated_at desc  [["post_id", 16]]

  def create
    @post = Post.new(post_params)
    @post.author = current_user

    if @post.save
---
INSERT INTO "posts" ("title", "content", "draft", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "3456"], ["content", "3434"], ["draft", "t"], ["user_id", 1], ["created_at", "2016-06-24 21:35:57.230710"], ["updated_at", "2016-06-24 21:35:57.230710"]]

  def edit
    @post = current_user.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 2], ["id", 17]]

  def update
    @post = current_user.posts.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 2], ["id", 17]]
UPDATE "posts" SET "title" = ?, "draft" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test"], ["draft", "f"], ["updated_at", "2016-06-24 23:06:58.678026"], ["id", 40]]

  def destroy
    @post = current_user.posts.find(params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 15]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]