app/controllers/profiles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 13]]
SELECT "comments".* FROM "comments" WHERE (user_id = 1)
---
  def info
    @profile = User.find(params[:id])
    @posts = Post.where("user_id = #{params[:id]}")
    @comments = Comment.where("user_id = #{params[:id]}")